Revit 2026 API

# PlasticVinylPlasticvinylBumpAmount Property

---

The property labeled "Amount" from the "PlasticVinyl" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string PlasticvinylBumpAmount { get; }
```
```vb
Public Shared ReadOnly Property PlasticvinylBumpAmount As String
	Get
```
```cpp
public:
static property String^ PlasticvinylBumpAmount {
	String^ get ();
}
```
```fsharp
static member PlasticvinylBumpAmount : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 1".

#### Reference

PlasticVinyl Class

Autodesk.Revit.DB.Visual Namespace